package CheatSheets;

import java.util.Scanner;

public class Map {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        //1. Видове
        //HashMap -> редът на записите не е гарантиран
        //LinkedHashMap -> редът на поставянето на записите се запазва (пъривят поставен запис си остава на първо място)
        //ТрееМап -> записите се сортират по ключ в лексикографски ред (ако ключовете са числа в ascending order, ако ключовете са текстове/симвози от a към z)

        //2.Основни функции
        //containsKey(key) -> проверява дали в map-a има запис с такъв ключ -> резултат true ако има, false ако няма
        //containsValue(value) -> проверява дали в map-a има запис с такова value -> резултат true ако има, false ако няма
        //keySet() -> връша всички ключове от всички записи
        //entrySet() -> връша всички записи
        //values() -> връща всички value-та от всички записи
        //get(ключ) -> връша стойността, която стои срещу дадения ключ
        //size() -> връща броя на записите
        //put(key, value) -> добавя запис с дадения ключ и стойност
        //putIfAbsent(key, value) -> добавя запис с дадения ключ и стойност, ако вече няма запис с такъв ключ
        //clear() -> премахва всички записи от map-a
        //remove(key) -> премахва запис с дадения ключ
        //remove(key, value) -> премахва запис с дадения ключ и стойност
    }
}
